[
  {
    "engine": "AzureOCR",
    "item": "data/article1.pdf",
    "text": "How Retrieval-Augmented Generation Can\nSupercharge Automation Tools\nPersonal Notes:\nWhat is RAG:\nRetrieval-Augmented Generation (RAG) is an architecture implemented in\n-\ngenerative AI models that enhances the reliability of the model by searching\nfor relevant information in an external database.\nStandard LLM models, such as GPT-4 are trained on static datasets such as\n-\nprovided websites and codebases up to a fixed cutoff date depending on\nwhen the model is implemented.\nRAG provides dynamic searching -- allowing a system to send a query to an\n-\nexternal retriever, such as the web or other knowledge bases (wikipedia).\nTraditional LLM Limitations:\nHallucinations: LLM “hallucination” describes the phenomena of LLM’s\n-\ngenerating incorrect information by relying on patterns in trained data\ninstead of real-time facts.\nLLM only “sees” a limited number of tokens and thus cannot “remember”\n-\nearlier parts of conversations and cannot directly process large documents or\nimages.\nRAG + LLM Solution:\nDynamic allocation of information prevents hallucinations. Utilizes search\n-\nengines and other web tools to get up-to-date information.\nRAG allows the retrieval of relevant snippets from large documents/PDF’s\n-\ninstead of having to process the entire provided input which prevents token\noverflow.\nHow RAG Supercharges Automation:\nContext-Aware Understanding: Automation relies on understanding the\n-\ncontext behind the task needed to be performed. RAG enables the system to\nrespond intelligently even if the LLM was not trained on the specific given\ninput.\nGenerating Next-Steps: RAG goes beyond summaries -- it can generate\n-\nentire new steps and take action by itself. Given a request from a user, RAG\nenables LLM processing to take decisions on its own and create its own task.\nThis happens through the retriever. When the user sends in a request,\n-\nRAG enables the retriever to pull contextual-data, outside of the\nLLM’s framework, to generate actions.\nScalability Across Departments:\n-\nSales: Auto-draft replies based on previous deals or proposals\n-\nHR: Answer employee queries about policy by retrieving from\n-\nhandbooks\nIT Support: Respond to requests using documentation and past tickets\n-\nFinance: Parse invoice-related queries and cross-reference accounting\n-\ndatabases"
  },
  {
    "engine": "AzureOCR",
    "item": "data/frenchinvoice1.pdf",
    "text": "(avantor™\nFacture N° 4067281407 du\ndelivered by VWr™\n31.01.2024\n___\n___\nTVA FR28351831292\n___\nFrance\n___\nFacturé à : 40003248\nDestinataire facture : 40003248\nLABORATOIRE ANYDIAG VEBIO\nLABORATOIRE ANYDIAG VEBIO\n9 RUE DE VERDUN\n9 RUE DE VERDUN\n94250 GENTILLY\n94250 GENTILLY\nPage 1 /\n2\nContact mon-service.clients\nTel. 0 825 02 30 30\nFax 0 825 02 30 35\nE-mail nepasrepondre.e-factures.fr@avantorsciences.com\nN° Client DO : 40003248\nN° Client DF : 40003248\nPos.\nArticle\nQté X Condt\nQté x Prix un.\nTotal et remise\nPrix net\nVotre Numéro de commande BC_VWR_20112023 du 20.11.2023\nLivré à 40003248 LABORATOIRE ANYDIAG VEBIO\nJulie\nRUE DE VERDUN 9 FR-94250 GENTILLY\nCommande 4014528085 du 20.11.2023 - Note de Iivraison 4085218928 du 01.01.2024\n________________________________________________________________________________________________\n_________\nE-mail1: contact@vebio.fr\nUser: 1213490896\n10\n732-0884\n6 * 120 Pce\n6 * 119,59\n717,54\nbarettes de tubes pcr 0,2ml+bouchons ultra clear\nBatchNr: 1350928\n_______________________________________________________________________________________________\nMontant HT\nFrais\nTot HT\nTVA %\nMontant TVA\nMontant TTC\n717,54\n717,54\n20,0 %\n143,51\n861,05\nEUR\n_______________________________\n_______________________________\n_______________________________\n__\nConditions de livraison: Port payé\nConditions de paiement: 30 jours fin de mois\nServices comptables : Immeuble Estréo, 1-3 rue d'Aurion F-93114 Rosny-sous-Bois cedex\nVWR International S.A.S\nVWR International S.A.S\nCapital de 64.803.525 Euros\nImmeuble Estréo, 1-3 rue d'Aurion\nSiège social\nRCS Bobigny 421 287 855\nF-93114 Rosny-sous-Bois cedex\nImmeuble Estréo, 1-3 rue d'Aurion\nTVA FR 40 421 287 855\nTél: 0 825 02 30 30\nF-93114 Rosny-sous-Bois cedex\nAPE 4675Z\nFax: 0 825 02 30 35\nSIREN 421 287 855\n164\n(avantor™\nFacture N° 4067281407 du\ndelivered by VWr™\n31.01.2024\n___\nFrance\n___\nPage 2 /\n2\nPos.\nArticle\nQté X Condt\nQté x Prix un.\nTotal et remise\nPrix net\nA REGLER AVANT LE: 29.02.2024\n*\nSans escompte sauf accord particulier\n* * * * * * * * *\nSi vous souhaitez recevoir vos factures sous la forme d'un fichier PDF sécurisé, merci de\ncommuniquer la(les) adresse(s) Email de réception souhaitée(s) à\ne-factures.fr@avantorsciences.com\nPaiements en EUR - IBAN : FR76 11689 00700 00657150002 90 ; BIC : CITIFRPP\nConditions de vente : Nos ventes sont soumises aux Conditions Générales de Vente de VWR International,\nconsultables sur nos catalogues ou sur fr.vwr.com.\nEn passant commande, vous déclarez en avoir pris connaissance et en accepter l'ensemble des termes et conditions.\nAttention : nos marchandises sont vendues sous le bénéfice de la clause de réserve de propriété.\nNuméro SIREN : 421 287 855\nTVA FR 40 421 287 855\nCapital de 64.803.525 Euros - RCS Créteil 421 287 855\nNos factures sont au régime de TVA sur les débits.\nEn cas de retard de paiement par rapport à la date mentionnée sur la facture, VWR International pourra suspendre\ntoute commande en cours, sans préjudice de toute autre voie d'action,et réclamer des pénalités de retard au taux\ndirecteur semestriel de la BCE en vigueur au 1er janvier ou au 1er juillet +10 points exigibles de plein droit le jour\nsuivant la date de règlement ainsi qu'une indemnité forfaitaire de 40 euros pour frais de recouvrement.\nSi nous subissons une hausse du tarif de nos fournisseurs en raison de l'augmentation sensible du cours d'une matière\npremière, nous nous réservons le droit de répercuter cette hausse sur nos prix, à tout moment, si celle-ci est\nsupérieure à 3%.\nLivraison Intra Communautaire : Exonération TVA, article ART.262 ter-I du CGI\nExonération TVA, art. 262-1 du CGI\nServices comptables : Immeuble Estréo, 1-3 rue d'Aurion F-93114 Rosny-sous-Bois cedex\nVWR International S.A.S\nCapital de 64.803.525 Euros\nClient 40003248\nImmeuble Estréo, 1-3 rue d'Aurion\nRCS Bobigny 421 287 855\nFacture N° 4067281407 du 31.01.2024\nF-93114 Rosny-sous-Bois cedex\nTVA FR 40 421 287 855\nEchéance 29.02.2024\nTél: 0 825 02 30 30\nAPE 4675Z\nTOTAL NET A PAYER TTC EUR\n861,05\nFax: 0 825 02 30 35\nSIREN 421 287 855\n165"
  },
  {
    "engine": "AzureOCR",
    "item": "data/frenchinvoice2.pdf",
    "text": "iodolab\nExplorations nutritionnelles\nFacture n°FA5755\nDate :\n18.01.2024\nCode client :\nS351831292\nANYDIAG\n9 RUE DE VERDUN\nN° de TVA intracom :\nFR28351831292\n94250 GENTILLY\nNuméro de Dossier :\n240112001\nDate d'édition :\n18/01/2024 00:00:00\nFACTURE en Euros\nArticle\nRèf. Client\nDésignation\nQté\nP.U. HT\n% Rem\nMontant HT\nTVA\nTransformé de : Commande N° CC0590 du\n12/01/2024.\nADS051\n20240111004\nVitamine E\n1,00\n31,90\n20\n25,52 20,00\nADS055\n20240111004\nSélénium\n1,00\n30,80\n30,80 20,00\nEchéances & Réglements\nTotal brut HT :\n56,32\nRemise\n20,00%\n11,26\nDate\nMontant\nMoyen de paiement\nNet HT :\n45,06\n18/01/2024\n54,07\nVirement\nTVA :\n9,01\nService Comptabilité\n04 37 50 29 91\nNet TTC :\n54,07\nNet à payer\n54,07 €\nConditions d'escompte pour paiement anticipé : néant\nTaux Annuel de pénalités de retards : 15%\nx\nA joindre à votre règlement :\nIODOLAB\nIndemnité forfaitaire de 40€ pour frais de recouvrement en cas de retard de paiement\nCLIENT :\nANYDIAG\nN° FACTURE :\n3 route des Pierres Blanches\nCoordonnées bancaires :\nFA5755\n69290 GREZIEU LA VARENNE\nIBAN\nBIC\nDATE :\n18/01/2024\nTel. 04.78.57.66.09\nFR76 3000 4022 7800 0100 4529 603\nBNPAFRPPTAS\nSolde dû :\n54,07 €\ncontact@iodolab.com\nwww.iodolab.com\nSAS au capital de 63 000€ - Siret 450 647 813 00028 - 450 647 813 RCS LYON - APE 7500 Z\niodolab\nConditions Générales de Vente\nApplicable le 01/03/22\nExplorations nutritionnelles\n1. Commande\nToute commande passée chez lodolab implique de la part du demandeur l'adhésion pleine et entière aux conditions decrites dans ce document. Toute\ndemande de conditions de prestation particulières fait l'objet d'un accord écrit entre le client et le laboratoire.\nToute demande de prestations doit faire l'objet d'une commande écrite de la part du client. Celle-ci devra mentionner, au minimum, la référence des\néchantillons, la désignation des prestations demandées, l'identité du demandeur, les adresses de livraison de résultats et de facturation. Dans le cas où le\ndevis n'est pas retourné daté et signé, celui-ci sera considéré comme accepté par le client dès la réception du premier échantillon. Tout retard eventuel dans\nla production de résultats ne pourra donner lieu au profit du client à des dommages et intérêts ou à l'annulation de la commande.\n2. Echantillons\nLe contenu et l'identification des échantillons sont sous la responsabilité des clients. Le laboratoire pourra conseiller le client sur le conditionnement et les\nconditions d'envoi à respecter. Les échantillons sont acheminés au laboratoire sous la responsabilité du client et les frais de transports sont à sa charge. La\nstabilité et la conservation de l'échantillon jusqu'à son arrivée dans nos locaux est sous la responsabilité du client. lodolab se réserve le droit de faire figurer\nsur le rapport d'analyse toutes les mentions qu'il jugerait nécessaire concernant l'anomalie d'acheminement et les conséquences sur le résultat ou de refuser\nde réaliser les analyses sur des échantillons dont les conditions d'acheminement ne répondraient pas aux exigences. Le laboratoire n'emet ni avis ni\ninterprétation sur les résultats rendus. Les résultats des essais de lodolab ne déclenchent pas de déclaration de conformité/non-conformité. Le laboratoire\nconserve les échantillons deux semaines après la date d'analyse avant de les détruire, sauf demande particulière du client.\n3. Sous-traitance\nlodolab ne sous-traite pas les analyses qui font partie de son savoir-faire. Les sous-traitances habituelles sont dûment indiquées dans les devis et/ou contrats\net/ou catalogue de prestations et/ou le site internet. Certaines analyses peuvent être sous-traitées dans le cas ou lodolab ne peut les réaliser à cause de\nproblèmes techniques momentanes. Le client est toujours informe de la decision d'une sous-traitance. L'identité du sous-traitant est communiquée au client\nsur sa demande. lodolab se réserve le droit de choisir ses sous-traitants à partir de critères de compétences, notoriété, proximité, relation commerciale. Les\nanalyses sous-traitées sont mentionnées comme telles dans les rapports d'analyses avec le symbole \".\n4. Information des clients sur la réalisation des analyses sous accréditation (accréditation nº1-5728, essais, portée disponible sur\nwww.cofrac.fr)\nLes analyses pour lesquelles lodolab est accrédité sont identifiées dans les devis/catalogue de prestations /rapports. Toutefois, le travail du laboratoire peut\nprésenter exceptionnellement des écarts ayant une incidence sur le maintien de l'analyse sous accréditation. Dans ce cas le résultat ne sera pas rendu sous\naccreditation et l'écart sera specifie sur le rapport. Lorsque le logo Cofrac apparait sur le rapport d'analyse, il indique qu'une analyse au moins a été réalisée\nsous accreditation. Selon le GEN REF 11, nos clients ont l'interdiction d'utiliser notre marque d'accreditation autrement que par la reproduction integrale des\nrapports émis. Le cas échéant, lodolab aurait l'obligation d'informer le COFRAC d'une mauvaise utilisation ou d'un usage abusif de la marque d'accreditation\nou du logo COFRAC.\n5. Confidentialité\nLe laboratoire applique un principe strict de confidentialité sur toutes les informations obtenues ou générées au cours de ses activités. Les rapports d'analyse\nne sont transmis qu'aux personnes désignées par le client. Ils sont envoyés par mail qu'a(aux) l'adresse(s) du(des) destinataire(s) que vous nous avez\nmentionnée(s). Le client s'engage a prevenir lodolab en cas de modification de la (ou des) adresses de messagerie. Le demandeur de l'analyse peut\nnéanmoins faire une demande ecrite et explicite pour qu'une copie supplémentaire du rapport d'analyse soit transmise a un tiers. Les rapports d'analyses\nau format PDF sont protégés, autorisant uniquement la lecture et l'impression mais en aucun cas la modification. lodolab s'autorise à utiliser les données\ndes essais à des fins statistiques ou de recherche sauf refus explicite du client. Aucune donnée ne sera diffusée à des tiers non concernés par cette prestation.\n6. Mise à disposition des rapports d'analyses sur notre site internet\nConformément aux exigences de la norme NF EN ISO/CEI 17025, l'accès à ces données est soumis à convention entre les deux parties. lodolab met à\ndisposition de ses clients qui en font la demande un accès sécurisé aux données qui leurs sont propres via son site internet. Cette mise à disposition se fait\nvia un login et un mot de passe personnels garantissant l'accès exclusif aux données propres a l'utilisateur. Il appartient a tout utilisateur de s'assurer de la\nnon-divulgation de ses codes d'accès\n7. Prix\nLes prestations sont facturées au tarif et aux conditions en vigueur a la date de réception des échantillons, sauf devis ou contrat. Les prix sont libellés en\neuros et calculés hors taxe (20 % si applicable). La société lodolab s'accorde le droit de modifier ses tarifs à tout moment. Toutefois, elle s'engage à facturer\nles prestations au prix indique lors de l'enregistrement de la demande ou de tout autre accord écrit particulier. Le laboratoire se réserve la possibilité de\ndemander un acompte à la commande.\n8. Règlement\nLes factures sont payables à réception. Nous vous précisions que tout retard de paiement donnera lieu à l'application d'une pénalité égale à trois fois le\ntaux d'intérêt légal ainsi qu'une indemnité forfaitaire pour frais de recouvrement de 40 euros.\n9. Assurance Qualité\nLe laboratoire fonctionne sous assurance qualité, selon la norme internationale NF EN ISO/CEI 17025 applicable aux laboratoires d'essais. A ce titre, un\nmanuel qualité décrivant le fonctionnement et l'organisation du laboratoire est à la disposition des clients. De même, ces derniers peuvent, à leur demande,\nvisiter le laboratoire.\n10. Réclamations\nLes clients peuvent faire part de leurs observations et de leurs réclamations au laboratoire. Ces dernières font l'objet d'un enregistrement, qui déclenche, le\ncas échéant, la mise en œuvre d'actions correctives qui alimentent le processus d'amélioration continue instigue par le fonctionnement sous assurance\nqualité. A tout moment, le client peut avoir accès a notre logigramme de traitement de réclamation.\n11. Incertitudes\nLes incertitudes des méthodes sont disponibles au laboratoire."
  },
  {
    "engine": "AzureOCR",
    "item": "data/koreaninvoice1.pdf",
    "text": "1 STGEN BIO\n인천광역시 연수구 지식기반로 45\n발주서\n(Purchase Order)\n수신처 : 스테리바이오테크 주식회\n발신 : 에스티젠바이오(주)\n전화번호 : 0313856660\n전화번호 :\nFAX 번호 : 0313826668\nFAX 번호 : 070-8677 -3620\n▷ 발주사항\n1. 발주번호(PO Num)\nPO24112642 / 1\n2. 발주총금액 (VAT 별도)\n1,720,000.00\n3. 발주일자\n2024-11-11\n4. 발주자 / 전화번호\n박철균 /\n5.납품장소\n인천광역시 연수구 지식기반로\n45(송도동)\n6.겁수자(대금지급문의)\n최지현(070-8636 - 1131) /\nj2182014@donga.co.kr\n7.대금지급조건\n60일 어음 또는 어음대체결제수단\n▷ 발주품목\n(VAT 별도)\n품목\nL-I\n품번\n품명 및 규격\n수량\n단위\n납기일\n단가\n금액\nM170927000017\nA100\nNovaSeptum Manual Crimping Tool kit\n1.00\nSET\n2024-11 -08\n1,720,000.00\n1,720,000.00\n합 계\n1,720,000.00\n▷ 기타 공급조건\n1. 공급자가 본 발주서를 열람하면서 이에 대해 \"합의\" 처리하는 경우 합의된 것으로 간주합니다.\n2. 원자재 등의 현격한 가격변동 및 기타 노무비, 운송료 등 원가에 영향을 미치는 변화에 따라 발주 대금 및 단가 등의 조정이\n필요한 경우 반드시 본 건 발주서의 \"합의\" 전 발주서에 기재되어 있는 발주자(구매담당자)에게 연락 및 해당 변동사항을\n통지하여 협의 바랍니다.\n3. 물품수령 후 10일 이내 약사법 및 의약품등의제조및품질관리기준(GMP) 규정 등에서 권고하는 방법에 따라 검사하며, 미생물\n시험 등 검사방법에 따라 장시간의 검사가 불가피 하게 소요되는 경우 검사결과 도출이 더 늦어질 수 있습니다.\n4. 납품 전에 반드시 S*TEPS의 [검수요청대기현황]에서 해당 건을 선택하시고 거래명세서 흑은 납품내역서를 첨부하여 [검수요청]\n바랍니다.\n5. 납품은 발주서상의 납기일 이내에 주문 전량이 납품 장소에 현품으로 인도되고 당사의 겁수에 합격한 경우에 한하여 납품이\n완료된 것으로 처리합니다.\n6. 검수결과 블합격한 제품은 즉시 회수하고 교체하여야 하며 이에 소요된 비용은 공급자가 부담합니다.\n7. 보증보험증권 미제출시 대금지급이 지연될 수 있습니다.\n8. 본거례에 관한 내용을 제 3자에게 제공하거나 당사와의 경쟁관계에 있는 회사를 위하여 사용하지 않습니다.\n9. 당사외 발주사항 조회는 http://steps.dongasocio.com/에서 확인가능합니다.\n10. 기타 세부사항은 귀사와의 별도 계약서가 있을 경우 이를 적용하고 별도 계약이 없을 경우 상관례에 따릅니다.\n11. 당사 기본 지불조건은 납품후지급 조건입니다.\n에스티젠바이오(주)"
  },
  {
    "engine": "AzureOCR",
    "item": "data/koreaninvoice2.pdf",
    "text": "스테리바이오테크주식회사 / 2024.11.20 17:39:15\nPurchase Order (발주서)\n발주(PO)번호\n4501992309\n발주(PO)일자\n2024-05-21\n공급자\n스테리바이오테크주식회사\n발주자\n한미약품(주) 한미 본사\n주소\n인천 연수구 송도미래로 30 (송도BRC스마트\n밸리지식산업센터)비동901-1호\n주소\n서울시 송파구 방이동 45 한미타워\n담당자\n담당자\n박상용\nTEL\n031-385-6660\nFAX\nTEL\n02-410-9158\nFAX\n02-410-9259\n납품장소\n경기도 평택시 팽성읍 추팔산단로 114 한미 바이오플랜트\nTotal\n요청자\n이혜림\nTEL\nAmount\n5,740,000\nVAT 별도\n지급조건\n신한구매카드 발행 60일 후 만기\n(합계금액)\nNo\nMat.No\nDesc (자재내역) / 제조원\n(자재)\n/ MPN (제조자부품)\n수량\n단기\n금액\n납기일\n10\n146006815\n설비_1공장_GCSF K-Prime(ACS904) / 3way\nvalve / /\n2EA\n1,990,000\n3,980,000\n2024-06-11\n20\n146006817\nUV filters / /\n1EA\n1,760,000\n1,760,000\n2024-06-11\n1. 계약일반사항\n1) 본 발주서에 의거하여 주문하는 제품(이하 \"제품')의 수량, 단가, 공급가액, 납기일, 대금지급조건 및 지급통화(USD,\nEUR, JPY, CHF, GBP, 원화) 등 세부사항은 본 발주서 기재에 따른다. 단, 대금지급기일은 제4조에 따른 검사 후 납품조건\n의 준수 여부 등을 고려하여 연장될 수 있다.\n2) 발주자는 본 발주서를 공급자에게 서면으로 제출하여야 하고, 공급자가 본 발주서를 수령한 후 작업을 개시하거나, 5일\n이내에 특별한 의사표시를 하지 않는 경우 본 발주서를 승낙함으로써 계약이 성립된 것으로 본다.\n3) 계약기간은 본 발주서의 승낙일로부터 제품의 검사완료 후 대금지급 완료시까지로 한다.\n4) 본 발주서에 의거한 주문에 대하여 계약서가 별도로 존재하는 경우에는 해당 계약서의 내용이 본 발주서에 우선한다.\n2. 납품이행 등\n1) 공급자는 본 발주서 기재에 따라 발주자가 정한 납기일과 수량, 요구사양에 맞춰 정확한 납품을 이행할 의무를 부담한다\n2) 공급자는 납기일 내에 제품의 납품을 이행하지 못할 것이 예상되는 경우 즉시 발주자에게 이를 사전 통지하고 납기일 연\n장에 관하여 상호 협의하여야 한다.\n3) 공급자가 제2항의 납품 지연에 관하여 사전 통지하지 않고 정당한 사유 없이 납기일까지 제품의 전부 또는 일부를 납품\n하지 않은 경우 발주자는 제6조 제1항에 의거하여 본 계약의 전부 또는 일부를 해제 또는 해지할 수 있다.\n4) 공급자가 고의 또는 과실 없음을 증명하지 않는 한, 발주자는 전 항에 따른 본 계약의 해제 또는 해지와 별개로 공급자에\n대하여 납품 지연으로 인한 손해배상을 청구할 수 있다.\n3. 반품 등\n제품이 본 발주조건 또는 견본품(QC보관, 검수)과 상이할 경우 발주자는 이를 인수하지 않고 반품할 수 있으며, 공급자는\n합의된 조건을 충족하지 못하는 제품을 정상제품으로 교환하여야 한다. 반품 및 교환을 위해 발생하는 운송료 등 일체의 제\n반 비용은 공급자가 부담하기로 한다.\n4. 검사\n발주자는 납품된 제품에 대하여 정당한 사유가 있는 경우 외에는 그 수령일로부터 60일 이내에 공급자에게 검사 결과를 통\n지한다. 이 기간 내에 통지하지 아니한 경우에는 검사에 합격한 것으로 본다.\n5. 대금조정\n하도급법 적용대상 거래에 한하여, 공급원가 등의 변동에 따라 대금 조정이 불가피한 경우 공급자는 발주자에게 가격 변동\n에 대한 공문과 이를 확인할 수 있는 자료를 제출하여 대금 조정을 신청할 수 있고, 발주자는 자료 접수일로부터 10일 이내\n에 조정을 위한 협의를 개시한다.\n6. 해제·해지와 손해배상\n1) 발주자 또는 공급자가 본 계약상의 의무를 이행하지 아니하거나 위반하여 상대방으로부터 서면으로 이행최고 또는 시정\n요구를 받은 날로부터 10일이 경과하여도 그 의무를 이행하지 아니하거나 위반사항을 시정하지 아니한 경우, 상대방 당사\n자는 서면으로 본 계약의 전부 또는 일부를 해제 또는 해지할 수 있다.\n2) 발주자 또는 공급자가 어음 • 수표의 부도, 제3자에 의한 강제집행(가압류 및 가처분 포함), 파산신청, 회생절차개시 또\n는 간이회생절차개시의 신청 등 영업상의 중대한 사유가 발생하여 본 계약을 이행할 수 없다고 인정되는 경우 또는 기타 사\n유로 본 계약을 더 이상 지속할 수 없는 경우, 상대방 당사자는 서면으로 본 계약을 즉시 해제 또는 해지할 수 있다.\n3) 본 계약의 해제 또는 해지에 대한 귀책사유 있는 당사자는 그로 인하여 상대방 당사자에게 발생한 손해를 배상하여야 한\n다.\n한미약품 주식회사\n대표이사 박재현 (직인생략)"
  },
  {
    "engine": "Textract",
    "item": "data/article1.pdf",
    "text": "How Retrieval-Augmented Generation Can\nSupercharge Automation Tools\nPersonal Notes:\nWhat is RAG:\n- Retrieval-Augmented Generation (RAG) is an architecture implemented in\ngenerative AI models that enhances the reliability of the model by searching\nfor relevant information in an external database.\n- Standard LLM models, such as GPT-4 are trained on static datasets such as\nprovided websites and codebases up to a fixed cutoff date depending on\nwhen the model is implemented.\n- RAG provides dynamic searching -- allowing a system to send a query to an\nexternal retriever, such as the web or other knowledge bases (wikipedia).\nTraditional LLM Limitations:\n- Hallucinations: LLM \"hallucination\" describes the phenomena of LLM's\ngenerating incorrect information by relying on patterns in trained data\ninstead of real-time facts.\n- LLM only \"sees\" a limited number of tokens and thus cannot \"remember\"\nearlier parts of conversations and cannot directly process large documents or\nimages.\nRAG + LLM Solution:\n- Dynamic allocation of information prevents hallucinations. Utilizes search\nengines and other web tools to get up-to-date information.\n- RAG allows the retrieval of relevant snippets from large documents/PDF's\ninstead of having to process the entire provided input which prevents token\noverflow.\nHow RAG Supercharges Automation:\n- Context-Aware Understanding: Automation relies on understanding the\ncontext behind the task needed to be performed. RAG enables the system to\nrespond intelligently even if the LLM was not trained on the specific given\ninput.\n- Generating Next-Steps: RAG goes beyond summaries -- it can generate\nentire new steps and take action by itself. Given a request from a user, RAG\nenables LLM processing to take decisions on its own and create its own task.\n- This happens through the retriever. When the user sends in a request,\nRAG enables the retriever to pull contextual-data, outside of the\nLLM's framework, to generate actions.\n- Scalability Across Departments:\n- Sales: Auto-draft replies based on previous deals or proposals\n- HR: Answer employee queries about policy by retrieving from\nhandbooks\n- IT Support: Respond to requests using documentation and past tickets\n- Finance: Parse invoice-related queries and cross-reference accounting\ndatabases"
  },
  {
    "engine": "Textract",
    "item": "data/frenchinvoice1.pdf",
    "text": "N\navantor\nFacture N° 4067281407 du\ndelivered by vwr™\n31.01.2024\nTVA FR28351831292\nFrance\nFacturé à : 40003248\nDestinataire facture : 40003248\nLABORATOIRE ANYDIAG VEBIO\nLABORATOIRE ANYDIAG VEBIO\n9 RUE DE VERDUN\n9 RUE DE VERDUN\n94250 GENTILLY\n94250 GENTILLY\nPage 1/ 2\nContact mon-service.clients\nTel. 0 825 02 30 30\nFax 0 825 02 30 35\nE-mail nepasrepondre.e-factures.fr@avantorsciences.com\nN° Client DO : 40003248\nN° Client DF 40003248\nPos. Article\nQté X Condt\nQté X Prix un.\nTotal et remise\nPrix net\nVotre Numéro de commande BC_VWR_20112023 du 20.11.2023\nLivré à 40003248 LABORATOIRE ANYDIAG VEBIO Julie\nRUE DE VERDUN 9 FR-94250 GENTILLY\nCommande 4014528085 du 20.11.2023 Note de livraison 4085218928 du 01.01.2024\nE-mail1 contact@vebio.fr\nUser: 1213490896\n10\n732-0884\n6 120 Pce\n6 * 119,59\n717,54\nbarettes de tubes pcr 0,2ml+bouchons ultra clear\nBatchNr: 1350928\nMontant HT\nFrais\nTot HT\nTVA %\nMontant TVA\nMontant TTC\n717,54\n717,54\n20,0 %\n143,51\n861,05\nEUR\nConditions de livraison: Port payé\nConditions de paiement: 30 jours fin de mois\nServices comptables : Immeuble Estréo, 1-3 rue d'Aurion F-93114 Rosny-sous-Bois cedex\nVWR International S.A.S\nVWR International S.A.S\nCapital de 64.803.525 Euros\nImmeuble Estréo, 1-3 rue d'Aurion\nSiège social\nRCS Bobigny 421 287 855\nF-93114 Rosny-sous-Bois cedex\nImmeuble Estréo, 1-3 rue d'Aurion\nTVA FR 40 421 287 855\nTél: 0 825 02 30 30\nF-93114 Rosny-sous-Bois cedex\nAPE 4675Z\n164\nFax: 0 825 02 30 35\nSIREN 421 287 855\nN\navantor\nFacture N° 4067281407 du\ndelivered by vwr™\n31.01.2024\nFrance\nPage 2/ 2\nPos. Article\nQté X Condt\nQté X Prix un.\nTotal et remise\nPrix net\nA REGLER AVANT LE: 29.02.2024\nSans escompte sauf accord particulier\n*********\nSi vous souhaitez recevoir vos factures sous la forme d'un fichier PDF sécurisé, merci de\ncommuniquer la(les) adresse(s) Email de réception souhaitée(s) à\ne-factures.fr@avantorsciences.com\nPaiements en EUR IBAN : FR76 11689 00700 00657150002 90 BIC : CITIFRPP\nConditions de vente Nos ventes sont soumises aux Conditions Générales de Vente de VWR International,\nconsultables sur nos catalogues ou sur fr.vwr.com.\nEn passant commande, vous déclarez en avoir pris connaissance et en accepter l'ensemble des termes et conditions.\nAttention nos marchandises sont vendues sous le bénéfice de la clause de réserve de propriété.\nNuméro SIREN 421 287 855\nTVA FR 40 421 287 855\nCapital de 64.803.525 Euros RCS Créteil 287\nNos factures sont au régime de TVA sur les débits.\nEn cas de retard de paiement par rapport à la date mentionnée sur la facture, VWR International pourra suspendre\ntoute commande en cours, sans préjudice de toute autre voie d'action,et réclamer des pénalités de retard au taux\ndirecteur semestriel de la BCE en vigueur au 1er janvier ou au 1er juillet +10 points exigibles de plein droit le jour\nsuivant la date de règlement ainsi qu'une indemnité forfaitaire de 40 euros pour frais de recouvrement.\nSi nous subissons une hausse du tarif de nos fournisseurs en raison de l'augmentation sensible du cours d'une matière\npremière, nous nous réservons le droit de répercuter cette hausse sur nos prix, à tout moment, si celle-ci est\nsupérieure à 3%.\nLivraison Intra Communautaire Exonération TVA, article ART.262 ter-I du CGI\nExonération TVA, art. 262-1 du CGI\nServices comptables : Immeuble Estréo, 1-3 rue d'Aurion F-93114 Rosny-sous-Bois cedex\nVWR International S.A.S\nCapital de 64.803.525 Euros\nClient 40003248\nImmeuble Estréo, 1-3 rue d'Aurion\nRCS Bobigny 421 287 855\nFacture N° 4067281407 du 31.01.2024\nF-93114 Rosny-sous-Bois cedex\nTVA FR 40 421 287 855\nEchéance 29.02.2024\nTél: 0 825 02 30 30\nAPE 4675Z\nTOTAL NET A PAYER TTC EUR\n861,05\n165\nFax: 0 825 02 30 35\nSIREN 421 287 855"
  },
  {
    "engine": "Textract",
    "item": "data/frenchinvoice2.pdf",
    "text": "iodolab\nFacture n°FA5755\nExplorations nutritionnelles\nDate :\n18.01.2024\nCode client :\nS351831292\nANYDIAG\n9 RUE DE VERDUN\nN° de TVA intracom :\nFR28351831292\n94250 GENTILLY\nNuméro de Dossier :\n240112001\nDate d'édition :\n18/01/2024\nFACTURE en Euros\nArticle\nRèf. Client\nDésignation\nQté\nP.U. HT\n% Rem\nMontant HT\nTVA\nTransformé de : Commande N° CC0590 du\n12/01/2024.\nADS051\n20240111004\nVitamine E\n1,00\n31,90\n20\n25,52\n20,00\nADS055\n20240111004\nSélénium\n1,00\n30,80\n30,80\n20,00\nTotal brut HT :\n56,32\nEchéances & Réglements\nRemise\n20,00%\n11,26\nDate\nMontant\nMoyen de paiement\nNet HT :\n45,06\n18/01/2024\n54,07\nVirement\nTVA :\n9,01\nService Comptabilité\n04 37 50 29 91\nNet TTC :\n54,07\nNet à payer\n54,07€\nConditions d'escompte pour paiement anticipé : néant\nA joindre à votre règlement :\nTaux Annuel de pénalités de retards 15%\nIndemnité forfaitaire de 40€ pour frais de recouvrement en cas de retard de paiement\nCLIENT\nANYDIAG\nIODOLAB\nN° FACTURE :\nCoordonnées bancaires\nFA5755\n3 route des Pierres Blanches\n69290 GREZIEU LA VARENNE\nIBAN\nBIC\nDATE\n18/01/2024\nFR76 3000 4022 7800 0100 4529 603\nBNPAFRPPTAS\nSolde dû :\nTel. 04.78.57.66.09\n54,07€\ncontact@iodolab.com\nwww.iodolab.com\nSAS au capital de 63 000€ - Siret 450 647 813 00028 - 450 647 813 RCS LYON APE 7500 Z\niodolab\nConditions Générales de Vente\nApplicable le 01/03/22\nExplorations nutritionnelles\n1.\nCommande\nToute commande passée chez lodolab implique de la part du demandeur l'adhésion pleine et entière aux conditions décrites dans ce document. Toute\ndemande de conditions de prestation particulières fait l'objet d'un accord écrit entre le client et le laboratoire.\nToute demande de prestations doit faire l'objet d'une commande écrite de la part du client. Celle-ci devra mentionner, au minimum, la référence des\néchantillons, la désignation des prestations demandées, l'identité du demandeur, les adresses de livraison de résultats et de facturation. Dans le cas où le\ndevis n'est pas retourné daté et signé, celui-ci sera considéré comme accepté par le client dès la réception du premier échantillon. Tout retard éventuel dans\nla production de résultats ne pourra donner lieu au profit du client à des dommages et intérêts ou à l'annulation de la commande.\n2.\nEchantillons\nLe contenu et l'identification des échantillons sont sous la responsabilité des clients. Le laboratoire pourra conseiller le client sur le conditionnement et les\nconditions d'envoi à respecter. Les échantillons sont acheminés au laboratoire sous la responsabilité du client et les frais de transports sont à sa charge. La\nstabilité et la conservation de l'échantillon jusqu'à son arrivée dans nos locaux est sous la responsabilité du client. lodolab se réserve le droit de faire figurer\nsur le rapport d'analyse toutes les mentions qu'il jugerait nécessaire concernant l'anomalie d'acheminement et les conséquences sur le résultat ou de refuser\nde réaliser les analyses sur des échantillons dont les conditions d'acheminement ne répondraient pas aux exigences. Le laboratoire n'émet ni avis ni\ninterprétation sur les résultats rendus. Les résultats des essais de lodolab ne déclenchent pas de déclaration de conformité/non-conformité. Le laboratoire\nconserve les échantillons deux semaines après la date d'analyse avant de les détruire, sauf demande particulière du client.\n3.\nSous-traitance\nlodolab ne sous-traite pas les analyses qui font partie de son savoir-faire. Les sous-traitances habituelles sont dûment indiquées dans les devis et/ou contrats\net/ou catalogue de prestations et/ou le site internet. Certaines analyses peuvent être sous-traitées dans le cas ou lodolab ne peut les réaliser à cause de\nproblèmes techniques momentanés. Le client est toujours informé de la décision d'une sous-traitance. L'identité du sous-traitant est communiquée au client\nsur sa demande. lodolab se réserve le droit de choisir ses sous-traitants à partir de critères de compétences, notoriété, proximité, relation commerciale. Les\nanalyses sous-traitées sont mentionnées comme telles dans les rapports d'analyses avec le symbole\n4. Information des clients sur la réalisation des analyses sous accréditation (accréditation n°1-5728, essais, portée disponible sur\nwww.cofrac.fr)\nLes analyses pour lesquelles lodolab est accrédité sont identifiées dans les devis/catalogue de prestations /rapports. Toutefois, le travail du laboratoire peut\nprésenter exceptionnellement des écarts ayant une incidence sur le maintien de l'analyse sous accréditation. Dans ce cas le résultat ne sera pas rendu sous\naccréditation et l'écart sera spécifié sur le rapport. Lorsque le logo Cofrac apparait sur le rapport d'analyse, il indique qu'une analyse au moins a été réalisée\nsous accréditation. Selon le GEN REF11, nos clients ont l'interdiction d'utiliser notre marque d'accréditation autrement que par la reproduction intégrale des\nrapports émis. Le cas échéant, lodolab aurait l'obligation d'informer le COFRAC d'une mauvaise utilisation ou d'un usage abusif de la marque d'accréditation\nou du logo COFRAC.\n5.\nConfidentialité\nLe laboratoire applique un principe strict de confidentialité sur toutes les informations obtenues ou générées au cours de ses activités. Les rapports d'analyse\nne sont transmis qu'aux personnes désignées par le client. Ils sont envoyés par mail qu'à(aux) l'adresse(s) du(des) destinataire(s) que vous nous avez\nmentionnée(s). Le client s'engage à prévenir lodolab en cas de modification de la (ou des) adresses de messagerie. Le demandeur de l'analyse peut\nnéanmoins faire une demande écrite et explicite pour qu'une copie supplémentaire du rapport d'analyse soit transmise à un tiers. Les rapports d'analyses\nau format PDF sont protégés, autorisant uniquement la lecture et l'impression mais en aucun cas la modification. lodolab s'autorise à utiliser les données\ndes essais à des fins statistiques ou de recherche sauf refus explicite du client. Aucune donnée ne sera diffusée à des tiers non concernés par cette prestation.\n6.\nMise à disposition des rapports d'analyses sur notre site internet\nConformément aux exigences de la norme NF EN ISO/CEI 17025, l'accès à ces données est soumis à convention entre les deux parties. lodolab met à\ndisposition de ses clients qui en font la demande un accès sécurisé aux données qui leurs sont propres via son site internet. Cette mise à disposition se fait\nvia un login et un mot de passe personnels garantissant l'accès exclusif aux données propres à l'utilisateur. Il appartient à tout utilisateur de s'assurer de la\nnon-divulgation de ses codes d'accès.\n7.\nPrix\nLes prestations sont facturées au tarif et aux conditions en vigueur à la date de réception des échantillons, sauf devis ou contrat. Les prix sont libellés en\neuros et calculés hors taxe (20 si applicable). La société lodolab s'accorde le droit de modifier ses tarifs à tout moment Toutefois, elle s'engage à facturer\nles prestations au prix indiqué lors de l'enregistrement de la demande ou de tout autre accord écrit particulier. Le laboratoire se réserve la possibilité de\ndemander un acompte à la commande.\n8.\nRèglement\nLes factures sont payables à réception. Nous vous précisions que tout retard de paiement donnera lieu à l'application d'une pénalité égale à trois fois le\ntaux d'intérêt légal ainsi qu'une indemnité forfaitaire pour frais de recouvrement de 40 euros.\n9.\nAssurance Qualité\nLe laboratoire fonctionne sous assurance qualité, selon la norme internationale NF EN ISO/CEI 17025 applicable aux laboratoires d'essais. À ce titre, un\nmanuel qualité décrivant le fonctionnement et l'organisation du laboratoire est à la disposition des clients. De même, ces derniers peuvent, à leur demande,\nvisiter le laboratoire.\n10. Réclamations\nLes clients peuvent faire part de leurs observations et de leurs réclamations au laboratoire. Ces dernières font l'objet d'un enregistrement, qui déclenche, le\ncas échéant, la mise en oeuvre d'actions correctives qui alimentent le processus d'amélioration continue instigué par le fonctionnement sous assurance\nqualité. À tout moment, le client peut avoir accès à notre logigramme de traitement de réclamation.\n11.\nIncertitudes\nLes incertitudes des méthodes sont disponibles au laboratoire."
  },
  {
    "engine": "Textract",
    "item": "data/koreaninvoice1.pdf",
    "text": "PHORE #12 YR 'LL\nthem be % 3 |o CYCL I YYYY the 10.00\n1 11 torn 6\nthe №1 =n HOYE IX oh PR 1227 '8\nthe 1/4 oly 'L\nPhone 10 V ||||o #10 0001 |Y 11 '9\nthey OM 20\n|0 1010 PER totrito IB30 01 10vix #A 10 11 110H710 PICA 200 's\nthe\n1 OF 10 IYSTA ЮБ OF ' t\n1/1 10 F lo 1% IKto 12to ulo |y\n00 12to ( KO Ihlo 01 10 E\nthe\nHo KO to =m 0112 FY 1 FZ THE IYSTA 1°FC\nof 44 KO EH XA 12to = 100 oln 1 tale KO PZ HYLY N\nthe OK lot 1% HoHo ||ю|о YOU Y HE 'L\n72 <\n1,720,000.00\nFC\nTol\n1,720,000.00\n1,720,000.00\n2024-11-08\nSET\n1.00\nNovaSeptum Manual Crimping Tool kit\nA100\nM170927000017\nHO E\n143\n12\nHE\nOF OK\nFA=\nHH\n(VAT)\n== % n/o 09\nj2182014@donga.co.kr\n(1)\n(070-8636-1131) /\n(\n10 YOU\n2024-11-11\nYOU\n1,720,000.00\n(I 2\nPO24112642 / 1\n(wnN 1\n11 <\nFAX THE : 070-8677-3620\nFAX FL 0313826668\n0313856660 Fx\ntr\n: IVE\nIVV\n(Purchase Order)\nFY A\n45 EACY +\nSTGEN BIO\n\""
  },
  {
    "engine": "Textract",
    "item": "data/koreaninvoice2.pdf",
    "text": "00 A\nILY or ulo TOTAL KiD 10 HP 00 %Y YOU to\n14 10 L 10 11 |o 11 1°F 10 0) = THE 01\n00 E\nHELF 1/2 10 №1 of #A\nEHC TY =3 00 THE = n FY TO 100 vI == |o II (t)\n1/1 Yo == 12 =3 THE 29 to 010 |Y|o\n#A 12 == AX 11 10YE of 100% TO FYY 01 #A (ε\nHP 000 110+1+\nFo Toyo TYY |o to 10FC YY Yolo 200 ЮНт (s)\n11 1010 200 XIX PY 11 |2|n Y THE (L\n2\nTHE 10 00 10 Hy 212 11 THE (t)\n101. 11 1 THE Cook (ε\n102 of 100 10 v THE 1° 10 |Y|o YYYO PAS 10/7/0\nof 10/- v THE 00 on v THE 11 $2\n1/2 10 =0 TX lo\n+2 == B 7 ЮНУ С Y THE oln (10 GBP CHE ' Ydr EUR,\nKin 12 \"HE 11 (0) 111 THE 11\n10 it\n2024-06-11\n1,760,000\n1,760,000\n1EA\n/ / fillters AN\n146006817\n20\nvalve / /\n2024-06-11\n3,980,000\n1,990,000\n2EA\n146006815\n10\nблау /\n(YYY) NPW /\n(HY-Y)\n%A\nHO E\nHB\n170\nNo\nVI / Desco\nMat.No\n27 Hot 09\n5,740,000\nAmount\nTEL\n№10\nYou\n5% VA\nTotal\n01 11 2001 YHE 3/6°C\nVYEA\n02-410-9259\nFAX\n02-410-9158\nTEL\nFAX\n031-385-6660\nTEL\n100\nYou\n100 st of\nvx\n) 08 ++6 1x10\nY (10)\n11\nY\nYET\n2024-05-21\n(O)\n4501992309\n(0)\nPurchase Order (H)\nSI6875 2024111120 /\nPAYA\nYYYY 00\nct.\nПо of HOV ihi №10 IC = Y Ph = lot THE (E\nHELF Yo == |x THE on AHY THE 11 ivlo |-] of THE III\ntr to 23 to =1% IDE 1010 of THE HY THE to ulo TV =\n55 VLYYYY IXC KiO (1) №10 'I' 11 % = 1 $2\nHELF =3 ILY Ho 12 73 + of THE on\nthe ihiv '10 lylo % I 1001 22 10\niylv == on 01 7770 YOO 11 THE HAVE = 1 (L\nTYP ILY Ho '9\n% №1 Ю\nH710 01 IY 1 01 TY EN PO |o 1010 PH Ю\n07 ECt EYES to 10FY EH |2|n 10 |= toto 2010\nis\nbe OM 77 1010 70 YOYO 1ю Нт RIC lo\nшо 12 tv R ||||7|0 09 I r/r 1°F ER 100 BER\nthe to"
  },
  {
    "engine": "Tesseract",
    "item": "data/article1.pdf",
    "text": "How Retrieval-Augmented Generation Can\nSupercharge Automation Tools\n\nPersonal Notes:\n\nWhat is RAG:\n\n- Retrieval-Augmented Generation (RAG) is an architecture implemented in\ngenerative AI models that enhances the reliability of the model by searching\nfor relevant information in an external database.\n\n- Standard LLM models, such as GPT-4 are trained on static datasets such as\nprovided websites and codebases up to a fixed cutoff date depending on\nwhen the model is implemented.\n\n- RAG provides dynamic searching -- allowing a system to send a query to an\nexternal retriever, such as the web or other knowledge bases (wikipedia).\n\nTraditional LLM Limitations:\n\n- Hallucinations: LLM “hallucination” describes the phenomena of LLM’s\ngenerating incorrect information by relying on patterns in trained data\ninstead of real-time facts.\n\n- LLM only “sees” a limited number of tokens and thus cannot “remember”\nearlier parts of conversations and cannot directly process large documents or\nimages.\n\nRAG + LLM Solution:\n- Dynamic allocation of information prevents hallucinations. Utilizes search\nengines and other web tools to get up-to-date information.\n- RAG allows the retrieval of relevant snippets from large documents/PDF’s\ninstead of having to process the entire provided input which prevents token\noverflow.\n\nHow RAG Supercharges Automation:\n\nContext-Aware Understanding: Automation relies on understanding the\ncontext behind the task needed to be performed. RAG enables the system to\nrespond intelligently even if the LLM was not trained on the specific given\ninput.\nGenerating Next-Steps: RAG goes beyond summaries -- it can generate\nentire new steps and take action by itself. Given a request from a user, RAG\nenables LLM processing to take decisions on its own and create its own task.\n- This happens through the retriever. When the user sends in a request,\nRAG enables the retriever to pull contextual-data, outside of the\nLLM’s framework, to generate actions.\nScalability Across Departments:\n- Sales: Auto-draft replies based on previous deals or proposals\n- HR: Answer employee queries about policy by retrieving from\nhandbooks\n- IT Support: Respond to requests using documentation and past tickets\n- Finance: Parse invoice-related queries and cross-reference accounting\ndatabases\n"
  },
  {
    "engine": "Tesseract",
    "item": "data/frenchinvoice1.pdf",
    "text": "(J avantor’\n\nFacture N° 4067281407 du\n\n. ™ 31.01.2024\ndelivered by WWI —\nTVA FR28351831292\nFrance\nFacturé a : 40003248 Destinataire facture : 40003248\nLABORATOIRE ANYDIAG VEBIO LABORATOIRE ANYDIAG VEBIO\n9 RUE DE VERDUN 9 RUE DE VERDUN\n94250 GENTILLY 94250 GENTILLY\nPage1/ 2\nContact mon-service.clients Tel. 0 825 02 30 30 Fax 0 825 02 30 35\nE-mail nepasrepondre.e-factures.fr@avantorsciences.com\nN° Client DO : 40003248 N° Client DF : 40003248\nPos. Article Qté X Condt Qté x Prix un. Total et remise Prix net\nVotre Numéro de commande BC_VWR_20112023 du 20.11.2023\nLivré a 40003248 LABORATOIRE ANYDIAG VEBIO Julie\nRUE DE VERDUN 9 FR-94250 GENTILLY\nCommande 4014528085 du 20.11.2023 - Note de livraison 4085218928 du 01.01.2024\nE-mail1: contact@vebio.fr\nUser: 1213490896\n10 732-0884 6 * 120 Pce 6 * 119,59 717,54\n\nbarettes de tubes pcr 0,2ml+bouchons ultra clear\n\nBatchNr: 1350928\n\nMontant HT Frais Tot HT TVA %\n717,54 717,54 20,0 %\n\nMontant TVA Montant TTC\n143,51 861,05 EUR\n\nConditions de livraison: Port payé\nConditions de paiement: 30 jours fin de mois\n\nServices comptables : Immeuble Estréo, 1-3 rue d'Aurion F-93114 Rosny-sous-Bois cedex\n\nVWR International S.A.S VWR International S.A.S Capital de 64.803.525 Euros\nImmeuble Estréo, 1-3 rue d'Aurion Siége social RCS Bobigny 421 287 855\nF-93114 Rosny-sous-Bois cedex Immeuble Estréo, 1-3 rue d'Aurion TVA FR 40 421 287 855\nTél: 0 825 02 30 30 F-93114 Rosny-sous-Bois cedex APE 4675Z\n\nFax: 0 825 02 30 35 SIREN 421 287 855\n\n164\n\n\n(\\J avantor’ Facture N° 4067281407 du\n\ndelivered by WWI\" 31.01.2024 —\n\nFrance\n\nPage2/ 2\n\nPos. Article Qté X Condt Qté x Prix un. Total et remise Prix net\n\nA REGLER AVANT LE: 29.02.2024\n\n* Sans escompte sauf accord particulier\nwReK KK KKK KK\nSi vous souhaitez recevoir vos factures sous la forme d'un fichier PDF sécurisé, merci de\ncommuniquer la(les) adresse(s) Email de reception souhaitée(s) a\ne-factures.fr@avantorsciences.com\n\nPaiements en EUR - IBAN : FR76 11689 00700 00657150002 90 ; BIC : CITIFRPP\nConditions de vente ;. Nos ventes sont soumises aux Conditions Générales de Vente de VWR International,\nconsultables sur nos catalogues ou sur fr.vwr.com.\n\nEn passant commande, vous déclarez en avoir pris connaissance et en accepter l'ensemble des termes et conditions.\nAttention : nos marchandises sont vendues sous le bénéfice de la clause de réserve de propriété.\n\nNuméro SIREN : 421 287 855\n\nTVA FR 40 421 287 855\n\nCapital de 64.803.525 Euros - RCS Créteil 421 287 855\n\nNos factures sont au régime de TVA sur les débits.\n\nEn cas de retard de paiement par rapport a la date mentionnée sur la facture, VWR International pourra suspendre\ntoute commande en cours, sans préjudice de toute autre voie d'action,et reclamer des pénalités de retard au taux\ndirecteur semestriel de la BCE en vigueur au 1er janvier ou au (er juillet +10 points exigibles de plein droit le jour\nsuivant la date de reglement ainsi qu'une indemnité forfaitaire de 40 euros pour frais de recouvrement.\n\nSi nous subissons une hausse du tarif de nos fournisseurs en raison de l'augmentation sensible du cours d'une matiére\npremiére, nous nous réservons le droit de répercuter cette hausse sur nos prix, a tout moment, si celle-ci est\nsupérieure a 3%.\n\nLivraison Intra Communautaire ; Exonération TVA, article ART.262 ter-| du CGI\nExonération TVA, art. 262-1 du CGI\n\nServices comptables : Immeuble Estréo, 1-3 rue d'Aurion F-93114 Rosny-sous-Bois cedex\n\nVWR International S.A.S Capital de 64.803.525 Euros Client 40003248\n\nImmeuble Estréo, 1-3 rue d'Aurion RCS Bobigny 421 287 855 Facture N° 4067281407 du 31.01.2024\n\nF-93114 Rosny-sous-Bois cedex TVA FR 40 421 287 855 Echéance 29.02.2024\n\nTél: 0 825 02 30 30 APE 4675Z TOTAL NET A PAYER TTC EUR 861,05\n\nFax: 0 825 02 30 35 SIREN 421 287 855\n"
  },
  {
    "engine": "Tesseract",
    "item": "data/frenchinvoice2.pdf",
    "text": "e |lodolab\n\nRT PEST Sr EP RECEDE I eR Carer Facture n°FA5755\nExplorations nutritionnelles\n\nDate : 18.01.2024\n\nCode client : $351831292\n\nANYDIAG\n\n9 RUE DE VERDUN\nN° de TVA intracom : FR28351831292\n94250 GENTILLY\n\n@ Numéro de Dossier : 240112001\n\nDate d'édition : 18/01/2024\n\nFACTURE en Euros\n\nArticle Ref. Client Désignation até P.U. HT Montant HT\n\nem\nTransformé de : Commande N° CC0590 du\n12/01/2024.\n20240111004 Vitamine E 31,90 20 25,52 |20,00\n20240111004 Sélénium 30,80 30,80 | 20,00\n\nEchéances & Réglements\n\nDate Moyen de paiement\n\n20,00%\n\n18/01/2024 , Virement TVA:\nService Comptabilité\n\n04 37 50 299 Net TTC: ,\nNet a payer 54,07 €\nConditions d'escompte pour paiement anticipé : néant A joindre a votre réglement :\nTaux Annuel de pénalités de retards : 15% a wn nnn nen nnn ee eee\nIndemnité forfaitaire de 40€ frais d t de retard de pai t of :\nIODOLAB naemnite tortaitaire ae pour trails de recouvrement en cas de retard ge palemen SN URE . ome\n3 route des Pierres Blanches Coordonnées bancaires : ATE. eoynor4\n69290 GREZIEU LA VARENNE IBAN BIC p DATE:\nTel. 04.78.57.66.09 FR76 3000 4022 7800 0100 4529 603 BNPAFRPPTAS Solde dd : 54,07 €\n\ncontact@iodolab.com\nwww.iodolab.com SAS au capital de 63 000€ - Siret 450 647 813 00028 - 450 647 813 RCS LYON - APE 7500 Z\n\ne j Oo d Oo | a b Conditions Générales de Vente Applicable le 01/03/22\n\n1. Commande\nToute commande passée chez lodolab implique de la part du demandeur l'adhésion pleine et entiére aux conditions décrites dans ce document. Toute\ndemande de conditions de prestation particuliéres fait objet d'un accord écrit entre le client et le laboratoire.\nToute demande de prestations doit faire fobjet d'une commande écrite de la part du client. Celle-ci devra mentionner, au minimum, la référence des\néchantillons, la désignation des prestations demandées, lidentité du demandeur, les adresses de livraison de résultats et de facturation. Dans le cas ou le\ndevis n'est pas retouné daté et signé, celui-ci sera considéré comme accepté par le client dés la reception du premier échantillon. Tout retard éventuel dans\nla production de résultats ne pourra donner lieu au profit du client 4 des dommages et intéréts ou & |'annulation de la commande.\n\n2. Echantillons\n\nLe contenu et l’identification des échantillons sont sous la responsabilité des clients. Le laboratoire pourra conseiller le client sur le conditionnement et les\nconditions d'envoi 4 respecter. Les échantillons sont acheminés au laboratoire sous la responsabilité du client et les frais de transports sont 4 sa charge. La\nstabilité et la conservation de |'Echantillon jusqu’a son arrivée dans nos locaux est sous la responsabilité du client. lodolab se réserve le droit de faire figurer\nsur le rapport d'analyse toutes les mentions qu'il jugerait nécessaire concernant !anomalie d'acheminement et les conséquences sur le résultat ou de refuser\nde réaliser les analyses sur des échantillons dont les conditions d'acheminement ne répondraient pas aux exigences. Le laboratoire n’émet ni avis ni\ninterprétation sur les résultats rendus. Les résultats des essais de lodolab ne déclenchent pas de déclaration de conformité/non-conformité. Le laboratoire\nconserve les échantillons deux semaines aprés la date d'analyse avant de les détruire, sauf demande particulére du client.\n\n3. Sous-traitance\n\nlodolab ne sous-traite pas les analyses qui font partie de son savoir-faire. Les sous-traitances habituelles sont diiment indiquées dans les devis et/ou contrats\netlou catalogue de prestations et/ou le site internet. Certaines analyses peuvent étre sous-traitées dans le cas ou lodolab ne peut les réaliser 4 cause de\nproblémes techniques momentanés. Le client est toujours informé de la décision d'une sous-traitance. L'identité du sous-traitant est communiquée au client\nsur sa demande. lodolab se réserve le droit de choisir ses sous-traitants 4 partir de critéres de compétences, notonété, proximité, relation commerciale. Les\nanalyses sous-traitées sont mentionnées comme telles dans les rapports d'analyses avec le symbole *.\n\n4. Information des clients sur la réalisation des analyses sous accréditation (accréditation n°1-5728, essais, portée disponible sur\nwww.cofrac.fr)\n\nLes analyses pour lesquelles lodolab est accrédité sont identifiées dans les devis/catalogue de prestations /rapports. Toutefois, le travail du laboratoire peut\nprésenter exceptionnellement des écarts ayant une incidence sur le maintien de |'analyse sous accréditation. Dans ce cas le résultat ne sera pas rendu sous\naccréditation et l'écart sera spécifié sur le rapport. Lorsque le logo Cofrac apparait sur le rapport d'analyse, il indique qu'une analyse au moins a été réalisée\nsous accréditation. Selon le GEN REF11, nos clients ont I'interdiction d'utiliser notre marque d'accréditation autrement que par la reproduction intégrale des\nrapports émis. Le cas échéant, lodolab aurait obligation d'informer le COFRAC d'une mauvaise utilisation ou d'un usage abusif de la marque d'accréditation\nou du logo COFRAC.\n\n5.  Confidentialité\n\nLe laboratowre applique un principe strict de confidentialité sur toutes les informations obtenues ou générées au cours de ses activités. Les rapports d’analyse\nne sont transmis qu’aux personnes désignées par le client. lls sont envoyés par mail qu’a(aux) l'adresse(s) du(des) destinataire(s) que vous nous avez\nmentionnée(s). Le client s'engage 4 prévenir lodolab en cas de modification de la (ou des) adresses de messagene. Le demandeur de !’analyse peut\nnéanmoins faire une demande écrite et explicite pour qu'une copie supplémentaire du rapport d’analyse soit transmise 4 un tiers. Les rapports d’analyses\nau format PDF sont protégés, autorisant uniquement la lecture et l'impression mais en aucun cas la modification. lodolab s'autorise a utiliser les données\ndes essais 4 des fins statistiques ou de recherche sauf refus explicite du client. Aucune donnée ne sera diffusée 4 des tiers non concernés par cette prestation.\n\n6. Mise a disposition des rapports d’analyses sur notre site internet\n\nConformément aux exigences de la norme NF EN ISO/CEI 17025, l'accés 4 ces données est soumis 4 convention entre les deux parties. lodolab met 4\ndisposition de ses clients qui en font la demande un accés sécursé aux données qui leurs sont propres via son site internet. Cette mise 4 disposition se fait\nvia un login et un mot de passe personnels garantissant l'accés exclusif aux données propres 4 Futilisateur. Il appartient 4 tout utilisateur de s'assurer de la\nnon-divulgation de ses codes d'accés.\n\n7. Prix\n\nLes prestations sont facturées au tarif et aux conditions en vigueur 4 la date de réception des échantillons, sauf devis ou contrat. Les prix sont libellés en\neuros et calculés hors taxe (20 % si applicable). La société lodolab s'accorde le droit de modifier ses tanifs 4 tout moment. Toutefois, elle s'engage a facturer\nles prestations au prix indiqué lors de |'enregistrement de la demande ou de tout autre accord écrit particulier. Le laboratoire se réserve la possibilité de\ndemander un acompte a la commande.\n\n8 Réglement\nLes factures sont payables 4 réception. Nous vous précisions que tout retard de paiement donnera lieu 4 |'application d'une pénalité égale 4 trois fois le\ntaux d'intérét /égal ainsi qu'une indemnité forfaitaire pour frais de recouvrement de 40 euros.\n\n9. Assurance Qualité\n\nLe laboratoire fonctionne sous assurance qualité, selon la norme internationale NF EN ISO/CEI 17025 applicable aux laboratoires d’essais. A ce titre, un\nmanuel qualité décrivant le fonctionnement et Forganisation du laboratoire est 4 la disposition des clients. De méme, ces derniers peuvent, a leur demande,\nvisiter le laboratoire.\n\n10. Réclamations\n\nLes clients peuvent faire part de leurs observations et de leurs réclamations au laboratowe. Ces derniéres font l'objet d'un enregistrement, qui déclenche, le\ncas échéant, la mise en ceuvre d'actions correctives qui alimentent le processus d’amélioration continue instigué par le fonctionnement sous assurance\nqualité. A tout moment, le client peut avoir accés 4 notre logigramme de traitement de réclamation.\n\n11. Incertitudes\nLes incertitudes des méthodes sont disponibles au laboratoire.\n"
  },
  {
    "engine": "Tesseract",
    "item": "data/koreaninvoice1.pdf",
    "text": "WW) STGEN BIO\n\nCIA BOA] 1 AIAIZ/ UE 45\n\nab\n(Purchase Order)\n\nSAH » Apjelstol ee] a Als wal; of AE|AlU}O| 2 (2)\nAt\n\nMstHlS -: 0313856660 Ast\n\nFAX'HS : 0313826668 FAX HS : 070-8677-3620\n\nALS\n\nPO24112642 / 1\n2024-11-11\n\nHEA\n\n° i,\nra}\n\n4| | 34 (070 - 8636 - 1131) /\nj2182014@donga.co.kr\n\n602 OS LE of Sha Bc\n\nDees (VAT =)\n\n712! ao\n\nM170927000017 2024-11-08 1,720,000.00 1,720,000.00\n\n1,720,000.00\n\n> JJEF} Sa2zH\n\n1. SHAVI & EMS ARSHHA oo] Hol “Eel” Aclot=E AS BIA AC! 2Fetect,\n\n2. HAL S2l Bag es JJlEF ey], 2SH S All SHS OAS HW shol] che} HE Hae S! Et7t SQ] BAO]\nBQetay oA BH BES] “Brel” A BEA FASO] ME SEAS SAH OIA] AS A da ASartss\nSA| Sto] HO) BPH ct.\n\n3. SETS = 102 OU SAH S! [SFR Sola ASA aAel|7|E(GMP) ta SAA Aaste BHol cet AApstoy, o|YS\nAW S AA Holl ce} BAZ] AAV SA se] ALFIE ANP AAAD FSO] OF RUA +S USdCt.\n\n4. tS Mol St&Al S*TEPSS| [(ASLAQ7 ASA AS AS MHA AMSA SE SSHIMS Aor (AFL2qy]\nHEELC},\n\n5. HEE BEMAtel] HA olulol FE ABol HS BA AZLS lesa Fate| Aol] AAs Alo sterol ESOl\n\nBEE AoOm xe Bch.\n\n. AFay See ASE SA] SP Sta Wal Stolof Spy Olol] ALA HSS Sart7t Pact.\n\n. HSHPRSS ABN AaAlsol Aas + USelct.\n\n. BA Ao] AE ASS Al ZAblAl ASSAL SASS] BA AAlol] Re SAS Ast} ABSA] BSI ct.\n\n. BAS| BEALS 223] http://steps.dongasocio.com/HlAl S}el7S tH ct.\n\n10. Z[Et MBAS HArSto| AS AA US AS oS ASsia AS Aloo] RS ST Ateeol cect.\n11. SAL7S ASAAS SHSS71B ZAAHCH.\n\noon ao\n\nol] AE] a ufo] 2 (2)\n\n"
  },
  {
    "engine": "Tesseract",
    "item": "data/koreaninvoice2.pdf",
    "text": "AE 2] MFO] SE] AZEAI S| AF / 2024.11.20 17:39:15\n\nPurchase Order (2f2=A))\n\n2024-05-21\n\nAb i|2| YEO] © El] A241 3] Af\n\nOM A> SLO 4S 30 (S[BRCAE\n4H 2] A[ AL AE OI All E})H| 901-15\n\n031-385-6660\n\nA= BAA Bas\nTotal\n\nAmount 5,740,000\n(2Ala oH)\n\nDesc (ALAHLY SA) / Ae\n/ MPN (A 2A} +7)\n\nott ao a7|a\n\nAtH|_1S@_GCSF K-Prime(ACS904) / 3way\nvalve /  /\n\n1,990,000 | 3,980,000 | 2024-06-11\n\n2024-06-11\n\n1) = SEAM! Sl 7loto] Fore AM S(Olst \"AM S\")Sl SS, H7t, Sa7H, H7IS, Harleza BF AaSst(USD,\nEUR, JPY, CHF, GBP, 2st) S A PAPAS & BEA 7/Mol CSch. Gt, AeSAla7/Ae A420] HS AA SF HBAA\nSEP HS SS Lehi ASS > an\n\n{| *\n\n2) BEALE BWM SSAlOI7\nOlio] SHS EAS si] BE AP B WES Su spo eM Aoto] AEEl Wow Sch,\nS ACIUE & UFM| SHAH MES Aes\n\na] 2\n\nOaA\n4) = SFA O71 St Lol] GHotoy ASFA 7} BSS BA ohE 2120) = 4 at AlopAt | 420) = LAO PA etct.\n\n2. tHolg\n\n1) SaAteE\n\n\"4 oln\n\nWM 7| Aol met WAAL} st ELVIAD PS, QTApeol| 4] WSs LSS o|We iPS SEs}\n\non! oe\n\n2) Sartte 87/2 Hol Aee| GSS OlHotr| RS Aol gaye SP SA) SEA! OLS APA SAlota B7IA a\nBol] LkstO, Ys Bol otO4 OF Stet.\n\n3) SAA Ml2S2| HS ALA Brotoy APA SAletA| Ba SSet At BO] G7lV7| Meo AF Sees aS\nott] SS APT SEALS MZ Alt Sol] Ol 7{sto] B Alto] MH FE ALS ofa = ofA] S + Act.\n\n4) Sar} 19 SEAL RSS SBS Be tt, SHAE A soll +S = Alote| Al Se salSt 7S SAAtoll\nChote] Ete A\\AOe olst AofMAs ATS + act.\n\n3. HE S\n\nASO PEA SE AES(QCHA, AT) Yolse Sf SAE OS olor] Ba thas + ULM, Sartre\ngle AUS SSCA Role MES SYM SLES wstotojof ste}. tls A WetS lol HYot= RSS S Yall Al\nHHS SaAV Peo stct\n\n4. At\nWERE ESE! Ml oll Hstol AetSt AAFIL UWE SS Sols 1 FYUS He} GOL oltfol] SAA] AA Aas S\nAl etch. O| 7| Zt Hol SAL SHA] ofl St APole AAfol PAs Aoe\n\nsleek HSd¥y A7ehol stotol, SsaH7t Sol HSol meh aa ZAO| S7tws SS SAAS LFAOlAl 7A HS\noO] Het SEA OS SIS + RUSARS MSs] Ha AGS USS FAD, SAE AS ASVSSS 102 Ole\nOo] EBS lst S2S AHA StCt\n\n1) SA FE SSA SASS S] APS Ol Ms] off[sp7yct F| Proto So POS Pe MHOe o/Mal FE AW\n3 Het 100] Athot4 = 2 AIFS O] BofA] oOfLlop7ct Sl HrAteatS ALA otal ofLlet AS, atch SAL\n\nBEASIAP SE ASS HM SE ALS + Ct.\n\nSE, ASA Set SAMBA We FY 7A BS), UNAS\n\nFo] SC St Ate 7h SMofol BS ASS ol Mat + cha Mase SP LE IIEt At\n>, ood SAME MHOS BASS SAl HA] SE ALS ACH.\n\n|2F2| off All ee oH ALO CHEE FIA AT R= SALAS 1 elotoy acy SALAtol Al Bast Aol S Hl oto oF St\n\n"
  }
]